<a href="https://colab.research.google.com/github/hyemin0408/2025-1-myclass-BDA/blob/main/inclass/01w_bigdata_basicUntitled1_ipynb%EC%9D%98_%EC%82%AC%EB%B3%B8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sys
sys. version

'3.11.11 (main, Dec  4 2024, 08:55:07) [GCC 11.4.0]'

In [ ]:
import site
site.getsitepackages()

['/usr/local/lib/python3.11/dist-packages',
 '/usr/lib/python3/dist-packages',
 '/usr/lib/python3.11/dist-packages']

In [ ]:
import numpy as np
import pandas as pd

print(np.__version__)
print(np.__version__)

1.26.4
1.26.4

## 코랩에서 한글 처리

In [ ]:
!pip install koreanize-matplotlib

Collecting koreanize-matplotlib
  Downloading koreanize_matplotlib-0.1.1-py3-none-any.whl.metadata (992 bytes)
Requirement already satisfied: matplotlib in /usr/local/lib/python3.11/dist-packages (from koreanize-matplotlib) (3.10.0)
Requirement already satisfied: contourpy>=1.0.1 in /usr/local/lib/python3.11/dist-packages (from matplotlib->koreanize-matplotlib) (1.3.1)
Requirement already satisfied: cycler>=0.10 in /usr/local/lib/python3.11/dist-packages (from matplotlib->koreanize-matplotlib) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in /usr/local/lib/python3.11/dist-packages (from matplotlib->koreanize-matplotlib) (4.56.0)
Requirement already satisfied: kiwisolver>=1.3.1 in /usr/local/lib/python3.11/dist-packages (from matplotlib->koreanize-matplotlib) (1.4.8)
Requirement already satisfied: numpy>=1.23 in /usr/local/lib/python3.11/dist-packages (from matplotlib->koreanize-matplotlib) (1.26.4)
Requirement already satisfied: packaging>=20.0 in /usr/local/lib/python3.11/dist-packages (from matplotlib->koreanize-matplotlib) (24.2)
Requirement already satisfied: pillow>=8 in /usr/local/lib/python3.11/dist-packages (from matplotlib->koreanize-matplotlib) (11.1.0)
Requirement already satisfied: pyparsing>=2.3.1 in /usr/local/lib/python3.11/dist-packages (from matplotlib->koreanize-matplotlib) (3.2.1)
Requirement already satisfied: python-dateutil>=2.7 in /usr/local/lib/python3.11/dist-packages (from matplotlib->koreanize-matplotlib) (2.8.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.11/dist-packages (from python-dateutil>=2.7->matplotlib->koreanize-matplotlib) (1.17.0)
Downloading koreanize_matplotlib-0.1.1-py3-none-any.whl (7.9 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 7.9/7.9 MB 68.1 MB/s eta 0:00:00
Installing collected packages: koreanize-matplotlib
Successfully installed koreanize-matplotlib-0.1.1

In [ ]:
# 그림 선명하게
%config lnlineBackend. figure_format = 'retina'

In [ ]:
import matplotlib.pyplot as plt
import koreanize_matplotlib

## 시리즈 개요

In [ ]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], name='first')
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
Name: first, dtype: float64

In [ ]:
s[2] = 50
s

0     1.0
1     3.0
2    50.0
3     NaN
4     6.0
5     8.0
Name: first, dtype: float64

In [ ]:
s.index = list('abcdef')
s

a     1.0
b     3.0
c    50.0
d     NaN
e     6.0
f     8.0
Name: first, dtype: float64

In [ ]:
s['a']

1.0

In [ ]:
s[0]

<ipython-input-28-c9c96910e542>:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[0]

1.0

In [ ]:
s[1:5]

b     3.0
c    50.0
d     NaN
e     6.0
Name: first, dtype: float64

In [ ]:
s['a':'d']

a     1.0
b     3.0
c    50.0
d     NaN
Name: first, dtype: float64

In [ ]:
sl = s[1:4]
sl

b     3.0
c    50.0
d     NaN
Name: first, dtype: float64

In [ ]:
sl[0]

<ipython-input-32-f4da7b95774b>:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  sl[0]

3.0

In [ ]:
s.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [ ]:
s.inde = np.arange(1,7)
s

a     1.0
b     3.0
c    50.0
d     NaN
e     6.0
f     8.0
Name: first, dtype: float64

In [ ]:
s[1:4] # 원 첨자인 0에서부터 참조

b     3.0
c    50.0
d     NaN
Name: first, dtype: float64

## 시리즈 고급인덱싱

In [ ]:
age = pd.Series([9, 17, 32, 45, 65, 98], index=list('abcdef'), name='age')
age

a     9
b    17
c    32
d    45
e    65
f    98
Name: age, dtype: int64

In [ ]:
age['f'] #  항목을 반환

98

In [ ]:
age[['f']] #  항목을 갖는 시리즈를 반환

f    98
Name: age, dtype: int64

## 불리안 인덱싱

In [ ]:
s[ s  > 0]

a     1.0
b     3.0
c    50.0
e     6.0
f     8.0
Name: first, dtype: float64

종료